app/controllers/api/poems_controller.rb

INSERT INTO "poems" ("title", "num_stanzas", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Genesis"], ["num_stanzas", 8], ["author_id", 32], ["created_at", "2015-10-16 16:55:09.216759"], ["updated_at", "2015-10-16 16:55:09.216759"]]
---
  def create
    @poem = current_user.poems.new(poem_params)
    if @poem.save

SELECT  "poems".* FROM "poems" WHERE (id = '23')  ORDER BY "poems"."id" ASC LIMIT 1
---
  def show
    @poem = Poem.includes(:author, stanzas: :author)
                .where('id = ?', params[:id])
                .first