app/controllers/api/stanzas_controller.rb

SELECT  "poems".* FROM "poems" WHERE "poems"."id" = $1 LIMIT 1  [["id", 29]]
SELECT "stanzas".* FROM "stanzas" WHERE "stanzas"."poem_id" = $1  ORDER BY "stanzas"."order" ASC  [["poem_id", 30]]
SELECT COUNT(*) FROM "stanzas" WHERE "stanzas"."poem_id" = $1  [["poem_id", 29]]
INSERT INTO "stanzas" ("body", "order", "author_id", "poem_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["body", "etehhbdtndn"], ["order", 4], ["author_id", 24], ["poem_id", 29], ["created_at", "2015-10-15 22:57:17.288972"], ["updated_at", "2015-10-15 22:57:17.288972"]]
---
  def create
    poem = Poem.find_by_id(params[:poem_id])
    @stanza = poem.stanzas.new(
      body: params[:body], order: poem.length + 1, author_id: current_user.id
    )
    if @stanza.save