app/views/api/poems/_poem.json.jbuilder

json.author poem.author.username
json.stanzas {json.array! poem.stanzas.order(:order) do |stanza|
---
SELECT "stanzas".* FROM "stanzas" WHERE "stanzas"."poem_id" = $1  ORDER BY "stanzas"."order" ASC  [["poem_id", 30]]