app/views/api/poems/_poem.json.jbuilder

json.author poem.author.username
json.timestamp distance_of_time_in_words(poem.created_at, Time.now)
---
INSERT INTO "poems" ("title", "num_stanzas", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Genesis"], ["num_stanzas", 8], ["author_id", 32], ["created_at", "2015-10-16 19:11:08.263743"], ["updated_at", "2015-10-16 19:11:08.263743"]]

  json.body stanza.body
  json.timestamp distance_of_time_in_words(stanza.created_at, Time.now)
end}
json.last_line poem.stanzas.last.lines.last
---
INSERT INTO "stanzas" ("body", "order", "author_id", "poem_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["body", "333333333333"], ["order", 6], ["author_id", 27], ["poem_id", 31], ["created_at", "2015-10-15 23:50:26.787066"], ["updated_at", "2015-10-15 23:50:26.787066"]]
SELECT "stanzas".* FROM "stanzas" WHERE "stanzas"."poem_id" = $1  [["poem_id", 31]]