app/views/api/poems/index.json.jbuilder

  json.author poem.author.username
  json.first_stanza poem.stanzas.first.body
---
SELECT  "stanzas".* FROM "stanzas" WHERE "stanzas"."poem_id" = $1  ORDER BY "stanzas"."id" DESC LIMIT 1  [["poem_id", 43]]