app/views/api/poems/show.json.jbuilder

SELECT "stanzas".* FROM "stanzas" WHERE "stanzas"."poem_id" = $1  [["poem_id", 22]]
---
json.author_id @poem.author_id
@poem.stanzas.each do |stanza|

INSERT INTO "stanzas" ("body", "order", "author_id", "poem_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["body", "11111111111111111"], ["order", 7], ["author_id", 27], ["poem_id", 30], ["created_at", "2015-10-15 23:46:07.184725"], ["updated_at", "2015-10-15 23:46:07.184725"]]
---
    json.author stanza.author.username  ### N+1 QUERY?
    json.time stanza.created_at