app/controllers/users_controller.rb

  def create
    @user = User.create(user_params)
    if @user.save
---
INSERT INTO "users" ("username", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "L6uSxleUX9afsYAz7f2XWw=="], ["updated_at", "2015-10-13 17:50:12.556960"], ["id", 1]]